In [1]:
from pyspark.sql import SparkSession
spark = SparkSession.builder.appName("practice1").getOrCreate()

22/01/18 21:33:03 WARN Utils: Your hostname, sunghwanui-MacBookPro.local resolves to a loopback address: 127.0.0.1; using 192.168.1.8 instead (on interface en0)
22/01/18 21:33:03 WARN Utils: Set SPARK_LOCAL_IP if you need to bind to another address
22/01/18 21:33:03 WARN NativeCodeLoader: Unable to load native-hadoop library for your platform... using builtin-java classes where applicable
Using Spark's default log4j profile: org/apache/spark/log4j-defaults.properties
Setting default log level to "WARN".
To adjust logging level use sc.setLogLevel(newLevel). For SparkR, use setLogLevel(newLevel).
22/01/18 21:33:04 WARN Utils: Service 'SparkUI' could not bind on port 4040. Attempting port 4041.
22/01/18 21:33:04 WARN Utils: Service 'SparkUI' could not bind on port 4041. Attempting port 4042.

In [3]:
df = spark.read.csv("test2.csv", header=True, inferSchema=True)
df.show()

+-------+----+----------+------+
|   Name| age|experience|Salary|
+-------+----+----------+------+
|  danny|  30|        10| 30000|
|hyunjoo|  33|      null| 40000|
| eileen|  23|         5| 70000|
| hailey|  44|         4|  3400|
|   null|null|      null| 40000|
|    kim|  36|         6|200000|
|   null|  87|         7| 30000|
|   null|  49|      null|  null|
+-------+----+----------+------+

In [4]:
df.dtypes

[('Name', 'string'), ('age', 'int'), ('experience', 'int'), ('Salary', 'int')]

In [5]:
df.columns

['Name', 'age', 'experience', 'Salary']

In [8]:
df.describe().show()

+-------+-----+------------------+------------------+------------------+
|summary| Name|               age|        experience|            Salary|
+-------+-----+------------------+------------------+------------------+
|  count|    5|                 7|                 5|                 7|
|   mean| null|43.142857142857146|               6.4|59057.142857142855|
| stddev| null| 21.17725644355733|2.3021728866442674|65188.620099494285|
|    min|danny|                23|                 4|              3400|
|    max|  kim|                87|                10|            200000|
+-------+-----+------------------+------------------+------------------+

In [10]:
df =df.withColumn("age 2",df["age"]+2)
df.show()

+-------+----+----------+------+-----+
|   Name| age|experience|Salary|age 2|
+-------+----+----------+------+-----+
|  danny|  30|        10| 30000|   32|
|hyunjoo|  33|      null| 40000|   35|
| eileen|  23|         5| 70000|   25|
| hailey|  44|         4|  3400|   46|
|   null|null|      null| 40000| null|
|    kim|  36|         6|200000|   38|
|   null|  87|         7| 30000|   89|
|   null|  49|      null|  null|   51|
+-------+----+----------+------+-----+

In [11]:
df = df.withColumnRenamed("age 2", "age two")
df.show()

+-------+----+----------+------+-------+
|   Name| age|experience|Salary|age two|
+-------+----+----------+------+-------+
|  danny|  30|        10| 30000|     32|
|hyunjoo|  33|      null| 40000|     35|
| eileen|  23|         5| 70000|     25|
| hailey|  44|         4|  3400|     46|
|   null|null|      null| 40000|   null|
|    kim|  36|         6|200000|     38|
|   null|  87|         7| 30000|     89|
|   null|  49|      null|  null|     51|
+-------+----+----------+------+-------+

In [12]:
df = df.drop("age two")
df

DataFrame[Name: string, age: int, experience: int, Salary: int]

In [13]:
df.show()

+-------+----+----------+------+
|   Name| age|experience|Salary|
+-------+----+----------+------+
|  danny|  30|        10| 30000|
|hyunjoo|  33|      null| 40000|
| eileen|  23|         5| 70000|
| hailey|  44|         4|  3400|
|   null|null|      null| 40000|
|    kim|  36|         6|200000|
|   null|  87|         7| 30000|
|   null|  49|      null|  null|
+-------+----+----------+------+

### missing

In [15]:
df.na.fill(0).show()

+-------+---+----------+------+
|   Name|age|experience|Salary|
+-------+---+----------+------+
|  danny| 30|        10| 30000|
|hyunjoo| 33|         0| 40000|
| eileen| 23|         5| 70000|
| hailey| 44|         4|  3400|
|   null|  0|         0| 40000|
|    kim| 36|         6|200000|
|   null| 87|         7| 30000|
|   null| 49|         0|     0|
+-------+---+----------+------+

In [22]:
df.na.drop(how="any",subset="name").show()

+-------+---+----------+------+
|   Name|age|experience|Salary|
+-------+---+----------+------+
|  danny| 30|        10| 30000|
|hyunjoo| 33|      null| 40000|
| eileen| 23|         5| 70000|
| hailey| 44|         4|  3400|
|    kim| 36|         6|200000|
+-------+---+----------+------+

In [21]:
df.show()

+-------+----+----------+------+
|   Name| age|experience|Salary|
+-------+----+----------+------+
|  danny|  30|        10| 30000|
|hyunjoo|  33|      null| 40000|
| eileen|  23|         5| 70000|
| hailey|  44|         4|  3400|
|   null|null|      null| 40000|
|    kim|  36|         6|200000|
|   null|  87|         7| 30000|
|   null|  49|      null|  null|
+-------+----+----------+------+

In [23]:
from pyspark.ml.feature import Imputer

In [26]:
imputer = Imputer(
inputCols = ["age", "experience", "Salary"],
outputCols = ['{}_imputed'.format(c) for c in ["age", "experience", "Salary"]]).setStrategy("mean")

In [27]:
imputer.fit(df).transform(df).show()

+-------+----+----------+------+-----------+------------------+--------------+
|   Name| age|experience|Salary|age_imputed|experience_imputed|Salary_imputed|
+-------+----+----------+------+-----------+------------------+--------------+
|  danny|  30|        10| 30000|         30|                10|         30000|
|hyunjoo|  33|      null| 40000|         33|                 6|         40000|
| eileen|  23|         5| 70000|         23|                 5|         70000|
| hailey|  44|         4|  3400|         44|                 4|          3400|
|   null|null|      null| 40000|         43|                 6|         40000|
|    kim|  36|         6|200000|         36|                 6|        200000|
|   null|  87|         7| 30000|         87|                 7|         30000|
|   null|  49|      null|  null|         49|                 6|         59057|
+-------+----+----------+------+-----------+------------------+--------------+

In [28]:
df.select("age").show()

+----+
| age|
+----+
|  30|
|  33|
|  23|
|  44|
|null|
|  36|
|  87|
|  49|
+----+

In [29]:
df.dtypes

[('Name', 'string'), ('age', 'int'), ('experience', 'int'), ('Salary', 'int')]

In [31]:
df.columns

['Name', 'age', 'experience', 'Salary']

In [32]:
df.head(5)

[Row(Name='danny', age=30, experience=10, Salary=30000),
 Row(Name='hyunjoo', age=33, experience=None, Salary=40000),
 Row(Name='eileen', age=23, experience=5, Salary=70000),
 Row(Name='hailey', age=44, experience=4, Salary=3400),
 Row(Name=None, age=None, experience=None, Salary=40000)]

In [34]:
for i in df.head(5):
    print(i['Name'])

danny
hyunjoo
eileen
hailey
None

In [36]:
df=spark.read.csv("test2.csv", header=True, inferSchema=True)
df.show()

+-------+----+----------+------+
|   Name| age|experience|Salary|
+-------+----+----------+------+
|  danny|  30|        10| 30000|
|hyunjoo|  33|      null| 40000|
| eileen|  23|         5| 70000|
| hailey|  44|         4|  3400|
|   null|null|      null| 40000|
|    kim|  36|         6|200000|
|   null|  87|         7| 30000|
|   null|  49|      null|  null|
+-------+----+----------+------+

In [37]:
df.filter("Salary >8000").show()

+-------+----+----------+------+
|   Name| age|experience|Salary|
+-------+----+----------+------+
|  danny|  30|        10| 30000|
|hyunjoo|  33|      null| 40000|
| eileen|  23|         5| 70000|
|   null|null|      null| 40000|
|    kim|  36|         6|200000|
|   null|  87|         7| 30000|
+-------+----+----------+------+

In [38]:
df.filter("Salary > 10000").show()

+-------+----+----------+------+
|   Name| age|experience|Salary|
+-------+----+----------+------+
|  danny|  30|        10| 30000|
|hyunjoo|  33|      null| 40000|
| eileen|  23|         5| 70000|
|   null|null|      null| 40000|
|    kim|  36|         6|200000|
|   null|  87|         7| 30000|
+-------+----+----------+------+

In [39]:
df.filter("Salary > 10000").select(["name", "age"]).show()

+-------+----+
|   name| age|
+-------+----+
|  danny|  30|
|hyunjoo|  33|
| eileen|  23|
|   null|null|
|    kim|  36|
|   null|  87|
+-------+----+

In [40]:
df.filter(df["Salary"]>10000).show()

+-------+----+----------+------+
|   Name| age|experience|Salary|
+-------+----+----------+------+
|  danny|  30|        10| 30000|
|hyunjoo|  33|      null| 40000|
| eileen|  23|         5| 70000|
|   null|null|      null| 40000|
|    kim|  36|         6|200000|
|   null|  87|         7| 30000|
+-------+----+----------+------+

In [41]:
df.filter((df["Salary"]>10000)&
          (df["Salary"]<200000) ).show()

+-------+----+----------+------+
|   Name| age|experience|Salary|
+-------+----+----------+------+
|  danny|  30|        10| 30000|
|hyunjoo|  33|      null| 40000|
| eileen|  23|         5| 70000|
|   null|null|      null| 40000|
|   null|  87|         7| 30000|
+-------+----+----------+------+

In [42]:
df.filter(~(df["Salary"]>10000)).show()

+------+---+----------+------+
|  Name|age|experience|Salary|
+------+---+----------+------+
|hailey| 44|         4|  3400|
+------+---+----------+------+

In [43]:
df.filter((df["Salary"]>10000)).show()

+-------+----+----------+------+
|   Name| age|experience|Salary|
+-------+----+----------+------+
|  danny|  30|        10| 30000|
|hyunjoo|  33|      null| 40000|
| eileen|  23|         5| 70000|
|   null|null|      null| 40000|
|    kim|  36|         6|200000|
|   null|  87|         7| 30000|
+-------+----+----------+------+